src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <predefined>
    <items>
      <name>Неопределен</name>
      <description>Неопределен</description>
    </items>
  </predefined>
  <attributes>
    <name>URLGitLab</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДПроектаGitLab</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PathGitClone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботыКонфигурации</name>
    <type>
      <types>EnumRef.РежимыРаботыКонфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогРепозиториевПроекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогСборкиРелиза</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогРепозиториевШара</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьКонфигурациюВРелиз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТокенJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>URLJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяJobJenkins</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПапкаАктуальныхОбработок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДляАктуализацииОбработок</name>
    <type>
      <types>CatalogRef.Базы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДBitrix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаРасширенийДляАктуализацииОбработок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРепозитория</name>
    <type>
      <types>EnumRef.ТипРепозитория</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Проекты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция НастройкиПроектов() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Проекты.Ссылка КАК Ссылка,
	|	Проекты.URLGitLab КАК URLGitLab,
	|	Проекты.PathGitClone КАК PathGitClone,
	|	Проекты.ИДПроектаGitLab КАК ИДПроектаGitLab,
	|	Проекты.ПарольJenkins КАК ПарольJenkins,
	|	Проекты.ТокенJenkins КАК ТокенJenkins,
	|	Проекты.URLJenkins КАК URLJenkins,
	|	Проекты.ИмяJobJenkins КАК ИмяJobJenkins,
	|	Проекты.КаталогСборкиРелиза КАК КаталогСборкиРелиза,
	|	Проекты.КаталогРепозиториевШара КАК КаталогРепозиториевШара,
	|	Проекты.КаталогРепозиториевПроекта КАК КаталогРепозиториевПроекта,
	|	Проекты.БазаДляАктуализацииОбработок КАК БазаДляАктуализацииОбработок,
	|	Проекты.БазаДляАктуализацииОбработок.ИмяПользователяИнформационнойБазы КАК БазаДляАктуализацииОбработокИмяПользователяИнформационнойБазы,
	|	Проекты.БазаДляАктуализацииОбработок.ПарольПользователяИнформационнойБазы КАК БазаДляАктуализацииОбработокПарольПользователяИнформационнойБазы,
	|	Проекты.БазаДляАктуализацииОбработок.КластерСерверов.Наименование КАК БазаДляАктуализацииОбработокКластерСерверовНаименование,
	|	Проекты.БазаДляАктуализацииОбработок.ИмяИнформационнойБазы КАК БазаДляАктуализацииОбработокИмяИнформационнойБазы,
	|	Проекты.ПапкаАктуальныхОбработок КАК ПапкаАктуальныхОбработок,
	|	Проекты.ИмяПользователяJenkins КАК ИмяПользователяJenkins,
	|	Проекты.СтрокаРасширенийДляАктуализацииОбработок КАК СтрокаРасширенийДляАктуализацииОбработок
	|ИЗ
	|	Справочник.Проекты КАК Проекты";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция НастройкиПроекта(Проект) Экспорт
	
	НастройкиПроектов = НастройкиПроектов();
	СтрокаПроекта = НастройкиПроектов.Найти(Проект, "Ссылка");
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаПроекта);
	
КонецФункции

Функция ПутьКПапкеСборкиОбработок(Проект) Экспорт

	КаталогСборкиРелиза = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Проект, "КаталогСборкиРелиза");
	Возврат СтрШаблон("%1\%2", КаталогСборкиРелиза, ПапкаСборкиОбработок());
	
КонецФункции

Функция ПапкаСборкиОбработок()
	Возврат "develop";
КонецФункции

#КонецОбласти

#КонецЕсли
